pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR64DU28def.inc
;***** THIS IS A MACHINE GENERATED FILE - DO NOT EDIT ********************

;*************************************************************************
;* A P P L I C A T I O N   N O T E   F O R   T H E   A V R   F A M I L Y
;*
;* Number            : AVR000
;* File Name         : AVR64DU28def.inc
;* Title             : Register/Bit Definitions for the AVR64DU28
;* Created           : 2024-04-23 15:45
;* Version           : 1.00
;* Support           : https://microchipsupport.force.com/
;* Target MCU        : AVR64DU28
;*
;* DESCRIPTION
;* When including this file in the assembly program file, all I/O register
;* names and I/O register bit names appearing in the data book can be used.
;* In addition, the six registers forming the three data pointers X, Y and
;* Z have been assigned names XL - ZH. Highest RAM address for Internal
;* SRAM is also defined
;*
;*************************************************************************

#ifndef _AVR64DU28DEF_INC_
#define _AVR64DU28DEF_INC_


#pragma partinc 0

; ***** SPECIFY DEVICE ***************************************************
.device	AVR64DU28

#pragma AVRPART ADMIN PART_NAME AVR64DU28

.equ	SIGNATURE_000	= 0x1E
.equ	SIGNATURE_001	= 0x96
.equ	SIGNATURE_002	= 0x22

#pragma AVRPART CORE CORE_VERSION V4S

.equ	USB_MAX_ENDPOINTS	= 16


; ***** ABSOLUTE I/O REGISTER LOCATIONS **********************************


;*************************************************************************
;** AC0 - Analog Comparator
;*************************************************************************

.equ AC0_CTRLA = 0x0680                  ; Control A
.equ AC0_MUXCTRL = 0x0682                ; Mux Control A
.equ AC0_DACREF = 0x0685                 ; DAC Voltage Reference
.equ AC0_INTCTRL = 0x0686                ; Interrupt Control
.equ AC0_STATUS = 0x0687                 ; Status

;*************************************************************************
;** ADC0 - Analog to Digital Converter
;*************************************************************************

.equ ADC0_CTRLA = 0x0600                 ; Control A
.equ ADC0_CTRLB = 0x0601                 ; Control C
.equ ADC0_CTRLC = 0x0602                 ; Control B
.equ ADC0_CTRLD = 0x0603                 ; Control E
.equ ADC0_CTRLE = 0x0604                 ; Control F
.equ ADC0_CTRLF = 0x0605                 ; Control D
.equ ADC0_INTCTRL = 0x0606               ; Interrupt Control
.equ ADC0_INTFLAGS = 0x0607              ; Interrupt Flags
.equ ADC0_STATUS = 0x0608                ; Status
.equ ADC0_DBGCTRL = 0x0609               ; Debug Control
.equ ADC0_COMMAND = 0x060A               ; Command
.equ ADC0_MUXPOS = 0x060B                ; Positive mux input
.equ ADC0_RESULT = 0x060C                ; ADC Accumulator Result
.equ ADC0_RESULTL = 0x060C               ; ADC Accumulator Result low byte
.equ ADC0_RESULTH = 0x060D               ; ADC Accumulator Result hi byte
.equ ADC0_SAMPLE = 0x060E                ; ADC Sample
.equ ADC0_SAMPLEL = 0x060E               ; ADC Sample low byte
.equ ADC0_SAMPLEH = 0x060F               ; ADC Sample hi byte
.equ ADC0_WINLT = 0x0610                 ; Window comparator low threshold
.equ ADC0_WINLTL = 0x0610                ; Window comparator low threshold low byte
.equ ADC0_WINLTH = 0x0611                ; Window comparator low threshold hi byte
.equ ADC0_WINHT = 0x0612                 ; Window comparator high threshold
.equ ADC0_WINHTL = 0x0612                ; Window comparator high threshold low byte
.equ ADC0_WINHTH = 0x0613                ; Window comparator high threshold hi byte
.equ ADC0_TEMP = 0x0614                  ; Temporary Data

;*************************************************************************
;** BOD - Bod interface
;*************************************************************************

.equ BOD_CTRLA = 0x00A0                  ; Control A
.equ BOD_CTRLB = 0x00A1                  ; Control B
.equ BOD_VLMCTRLA = 0x00A8               ; Voltage level monitor Control
.equ BOD_INTCTRL = 0x00A9                ; Voltage level monitor interrupt Control
.equ BOD_INTFLAGS = 0x00AA               ; Voltage level monitor interrupt Flags
.equ BOD_STATUS = 0x00AB                 ; Voltage level monitor status

;*************************************************************************
;** BOOTROW - Boot Row
;*************************************************************************

.equ BOOTROW_BOOTROW0 = 0x1100           ; Boot row 0
.equ BOOTROW_BOOTROW1 = 0x1101           ; Boot row 1
.equ BOOTROW_BOOTROW2 = 0x1102           ; Boot row 2
.equ BOOTROW_BOOTROW3 = 0x1103           ; Boot row 3
.equ BOOTROW_BOOTROW4 = 0x1104           ; Boot row 4
.equ BOOTROW_BOOTROW5 = 0x1105           ; Boot row 5
.equ BOOTROW_BOOTROW6 = 0x1106           ; Boot row 6
.equ BOOTROW_BOOTROW7 = 0x1107           ; Boot row 7
.equ BOOTROW_BOOTROW8 = 0x1108           ; Boot row 8
.equ BOOTROW_BOOTROW9 = 0x1109           ; Boot row 9
.equ BOOTROW_BOOTROW10 = 0x110A          ; Boot row 10
.equ BOOTROW_BOOTROW11 = 0x110B          ; Boot row 11
.equ BOOTROW_BOOTROW12 = 0x110C          ; Boot row 12
.equ BOOTROW_BOOTROW13 = 0x110D          ; Boot row 13
.equ BOOTROW_BOOTROW14 = 0x110E          ; Boot row 14
.equ BOOTROW_BOOTROW15 = 0x110F          ; Boot row 15
.equ BOOTROW_BOOTROW16 = 0x1110          ; Boot row 16
.equ BOOTROW_BOOTROW17 = 0x1111          ; Boot row 17
.equ BOOTROW_BOOTROW18 = 0x1112          ; Boot row 18
.equ BOOTROW_BOOTROW19 = 0x1113          ; Boot row 19
.equ BOOTROW_BOOTROW20 = 0x1114          ; Boot row 20
.equ BOOTROW_BOOTROW21 = 0x1115          ; Boot row 21
.equ BOOTROW_BOOTROW22 = 0x1116          ; Boot row 22
.equ BOOTROW_BOOTROW23 = 0x1117          ; Boot row 23
.equ BOOTROW_BOOTROW24 = 0x1118          ; Boot row 24
.equ BOOTROW_BOOTROW25 = 0x1119          ; Boot row 25
.equ BOOTROW_BOOTROW26 = 0x111A          ; Boot row 26
.equ BOOTROW_BOOTROW27 = 0x111B          ; Boot row 27
.equ BOOTROW_BOOTROW28 = 0x111C          ; Boot row 28
.equ BOOTROW_BOOTROW29 = 0x111D          ; Boot row 29
.equ BOOTROW_BOOTROW30 = 0x111E          ; Boot row 30
.equ BOOTROW_BOOTROW31 = 0x111F          ; Boot row 31
.equ BOOTROW_BOOTROW32 = 0x1120          ; Boot row 32
.equ BOOTROW_BOOTROW33 = 0x1121          ; Boot row 33
.equ BOOTROW_BOOTROW34 = 0x1122          ; Boot row 34
.equ BOOTROW_BOOTROW35 = 0x1123          ; Boot row 35
.equ BOOTROW_BOOTROW36 = 0x1124          ; Boot row 36
.equ BOOTROW_BOOTROW37 = 0x1125          ; Boot row 37
.equ BOOTROW_BOOTROW38 = 0x1126          ; Boot row 38
.equ BOOTROW_BOOTROW39 = 0x1127          ; Boot row 39
.equ BOOTROW_BOOTROW40 = 0x1128          ; Boot row 40
.equ BOOTROW_BOOTROW41 = 0x1129          ; Boot row 41
.equ BOOTROW_BOOTROW42 = 0x112A          ; Boot row 42
.equ BOOTROW_BOOTROW43 = 0x112B          ; Boot row 43
.equ BOOTROW_BOOTROW44 = 0x112C          ; Boot row 44
.equ BOOTROW_BOOTROW45 = 0x112D          ; Boot row 45
.equ BOOTROW_BOOTROW46 = 0x112E          ; Boot row 46
.equ BOOTROW_BOOTROW47 = 0x112F          ; Boot row 47
.equ BOOTROW_BOOTROW48 = 0x1130          ; Boot row 48
.equ BOOTROW_BOOTROW49 = 0x1131          ; Boot row 49
.equ BOOTROW_BOOTROW50 = 0x1132          ; Boot row 50
.equ BOOTROW_BOOTROW51 = 0x1133          ; Boot row 51
.equ BOOTROW_BOOTROW52 = 0x1134          ; Boot row 52
.equ BOOTROW_BOOTROW53 = 0x1135          ; Boot row 53
.equ BOOTROW_BOOTROW54 = 0x1136          ; Boot row 54
.equ BOOTROW_BOOTROW55 = 0x1137          ; Boot row 55
.equ BOOTROW_BOOTROW56 = 0x1138          ; Boot row 56
.equ BOOTROW_BOOTROW57 = 0x1139          ; Boot row 57
.equ BOOTROW_BOOTROW58 = 0x113A          ; Boot row 58
.equ BOOTROW_BOOTROW59 = 0x113B          ; Boot row 59
.equ BOOTROW_BOOTROW60 = 0x113C          ; Boot row 60
.equ BOOTROW_BOOTROW61 = 0x113D          ; Boot row 61
.equ BOOTROW_BOOTROW62 = 0x113E          ; Boot row 62
.equ BOOTROW_BOOTROW63 = 0x113F          ; Boot row 63
.equ BOOTROW_BOOTROW64 = 0x1140          ; Boot row 64
.equ BOOTROW_BOOTROW65 = 0x1141          ; Boot row 65
.equ BOOTROW_BOOTROW66 = 0x1142          ; Boot row 66
.equ BOOTROW_BOOTROW67 = 0x1143          ; Boot row 67
.equ BOOTROW_BOOTROW68 = 0x1144          ; Boot row 68
.equ BOOTROW_BOOTROW69 = 0x1145          ; Boot row 69
.equ BOOTROW_BOOTROW70 = 0x1146          ; Boot row 70
.equ BOOTROW_BOOTROW71 = 0x1147          ; Boot row 71
.equ BOOTROW_BOOTROW72 = 0x1148          ; Boot row 72
.equ BOOTROW_BOOTROW73 = 0x1149          ; Boot row 73
.equ BOOTROW_BOOTROW74 = 0x114A          ; Boot row 74
.equ BOOTROW_BOOTROW75 = 0x114B          ; Boot row 75
.equ BOOTROW_BOOTROW76 = 0x114C          ; Boot row 76
.equ BOOTROW_BOOTROW77 = 0x114D          ; Boot row 77
.equ BOOTROW_BOOTROW78 = 0x114E          ; Boot row 78
.equ BOOTROW_BOOTROW79 = 0x114F          ; Boot row 79
.equ BOOTROW_BOOTROW80 = 0x1150          ; Boot row 80
.equ BOOTROW_BOOTROW81 = 0x1151          ; Boot row 81
.equ BOOTROW_BOOTROW82 = 0x1152          ; Boot row 82
.equ BOOTROW_BOOTROW83 = 0x1153          ; Boot row 83
.equ BOOTROW_BOOTROW84 = 0x1154          ; Boot row 84
.equ BOOTROW_BOOTROW85 = 0x1155          ; Boot row 85
.equ BOOTROW_BOOTROW86 = 0x1156          ; Boot row 86
.equ BOOTROW_BOOTROW87 = 0x1157          ; Boot row 87
.equ BOOTROW_BOOTROW88 = 0x1158          ; Boot row 88
.equ BOOTROW_BOOTROW89 = 0x1159          ; Boot row 89
.equ BOOTROW_BOOTROW90 = 0x115A          ; Boot row 90
.equ BOOTROW_BOOTROW91 = 0x115B          ; Boot row 91
.equ BOOTROW_BOOTROW92 = 0x115C          ; Boot row 92
.equ BOOTROW_BOOTROW93 = 0x115D          ; Boot row 93
.equ BOOTROW_BOOTROW94 = 0x115E          ; Boot row 94
.equ BOOTROW_BOOTROW95 = 0x115F          ; Boot row 95
.equ BOOTROW_BOOTROW96 = 0x1160          ; Boot row 96
.equ BOOTROW_BOOTROW97 = 0x1161          ; Boot row 97
.equ BOOTROW_BOOTROW98 = 0x1162          ; Boot row 98
.equ BOOTROW_BOOTROW99 = 0x1163          ; Boot row 99
.equ BOOTROW_BOOTROW100 = 0x1164         ; Boot row 100
.equ BOOTROW_BOOTROW101 = 0x1165         ; Boot row 101
.equ BOOTROW_BOOTROW102 = 0x1166         ; Boot row 102
.equ BOOTROW_BOOTROW103 = 0x1167         ; Boot row 103
.equ BOOTROW_BOOTROW104 = 0x1168         ; Boot row 104
.equ BOOTROW_BOOTROW105 = 0x1169         ; Boot row 105
.equ BOOTROW_BOOTROW106 = 0x116A         ; Boot row 106
.equ BOOTROW_BOOTROW107 = 0x116B         ; Boot row 107
.equ BOOTROW_BOOTROW108 = 0x116C         ; Boot row 108
.equ BOOTROW_BOOTROW109 = 0x116D         ; Boot row 109
.equ BOOTROW_BOOTROW110 = 0x116E         ; Boot row 110
.equ BOOTROW_BOOTROW111 = 0x116F         ; Boot row 111
.equ BOOTROW_BOOTROW112 = 0x1170         ; Boot row 112
.equ BOOTROW_BOOTROW113 = 0x1171         ; Boot row 113
.equ BOOTROW_BOOTROW114 = 0x1172         ; Boot row 114
.equ BOOTROW_BOOTROW115 = 0x1173         ; Boot row 115
.equ BOOTROW_BOOTROW116 = 0x1174         ; Boot row 116
.equ BOOTROW_BOOTROW117 = 0x1175         ; Boot row 117
.equ BOOTROW_BOOTROW118 = 0x1176         ; Boot row 118
.equ BOOTROW_BOOTROW119 = 0x1177         ; Boot row 119
.equ BOOTROW_BOOTROW120 = 0x1178         ; Boot row 120
.equ BOOTROW_BOOTROW121 = 0x1179         ; Boot row 121
.equ BOOTROW_BOOTROW122 = 0x117A         ; Boot row 122
.equ BOOTROW_BOOTROW123 = 0x117B         ; Boot row 123
.equ BOOTROW_BOOTROW124 = 0x117C         ; Boot row 124
.equ BOOTROW_BOOTROW125 = 0x117D         ; Boot row 125
.equ BOOTROW_BOOTROW126 = 0x117E         ; Boot row 126
.equ BOOTROW_BOOTROW127 = 0x117F         ; Boot row 127
.equ BOOTROW_BOOTROW128 = 0x1180         ; Boot row 128
.equ BOOTROW_BOOTROW129 = 0x1181         ; Boot row 129
.equ BOOTROW_BOOTROW130 = 0x1182         ; Boot row 130
.equ BOOTROW_BOOTROW131 = 0x1183         ; Boot row 131
.equ BOOTROW_BOOTROW132 = 0x1184         ; Boot row 132
.equ BOOTROW_BOOTROW133 = 0x1185         ; Boot row 133
.equ BOOTROW_BOOTROW134 = 0x1186         ; Boot row 134
.equ BOOTROW_BOOTROW135 = 0x1187         ; Boot row 135
.equ BOOTROW_BOOTROW136 = 0x1188         ; Boot row 136
.equ BOOTROW_BOOTROW137 = 0x1189         ; Boot row 137
.equ BOOTROW_BOOTROW138 = 0x118A         ; Boot row 138
.equ BOOTROW_BOOTROW139 = 0x118B         ; Boot row 139
.equ BOOTROW_BOOTROW140 = 0x118C         ; Boot row 140
.equ BOOTROW_BOOTROW141 = 0x118D         ; Boot row 141
.equ BOOTROW_BOOTROW142 = 0x118E         ; Boot row 142
.equ BOOTROW_BOOTROW143 = 0x118F         ; Boot row 143
.equ BOOTROW_BOOTROW144 = 0x1190         ; Boot row 144
.equ BOOTROW_BOOTROW145 = 0x1191         ; Boot row 145
.equ BOOTROW_BOOTROW146 = 0x1192         ; Boot row 146
.equ BOOTROW_BOOTROW147 = 0x1193         ; Boot row 147
.equ BOOTROW_BOOTROW148 = 0x1194         ; Boot row 148
.equ BOOTROW_BOOTROW149 = 0x1195         ; Boot row 149
.equ BOOTROW_BOOTROW150 = 0x1196         ; Boot row 150
.equ BOOTROW_BOOTROW151 = 0x1197         ; Boot row 151
.equ BOOTROW_BOOTROW152 = 0x1198         ; Boot row 152
.equ BOOTROW_BOOTROW153 = 0x1199         ; Boot row 153
.equ BOOTROW_BOOTROW154 = 0x119A         ; Boot row 154
.equ BOOTROW_BOOTROW155 = 0x119B         ; Boot row 155
.equ BOOTROW_BOOTROW156 = 0x119C         ; Boot row 156
.equ BOOTROW_BOOTROW157 = 0x119D         ; Boot row 157
.equ BOOTROW_BOOTROW158 = 0x119E         ; Boot row 158
.equ BOOTROW_BOOTROW159 = 0x119F         ; Boot row 159
.equ BOOTROW_BOOTROW160 = 0x11A0         ; Boot row 160
.equ BOOTROW_BOOTROW161 = 0x11A1         ; Boot row 161
.equ BOOTROW_BOOTROW162 = 0x11A2         ; Boot row 162
.equ BOOTROW_BOOTROW163 = 0x11A3         ; Boot row 163
.equ BOOTROW_BOOTROW164 = 0x11A4         ; Boot row 164
.equ BOOTROW_BOOTROW165 = 0x11A5         ; Boot row 165
.equ BOOTROW_BOOTROW166 = 0x11A6         ; Boot row 166
.equ BOOTROW_BOOTROW167 = 0x11A7         ; Boot row 167
.equ BOOTROW_BOOTROW168 = 0x11A8         ; Boot row 168
.equ BOOTROW_BOOTROW169 = 0x11A9         ; Boot row 169
.equ BOOTROW_BOOTROW170 = 0x11AA         ; Boot row 170
.equ BOOTROW_BOOTROW171 = 0x11AB         ; Boot row 171
.equ BOOTROW_BOOTROW172 = 0x11AC         ; Boot row 172
.equ BOOTROW_BOOTROW173 = 0x11AD         ; Boot row 173
.equ BOOTROW_BOOTROW174 = 0x11AE         ; Boot row 174
.equ BOOTROW_BOOTROW175 = 0x11AF         ; Boot row 175
.equ BOOTROW_BOOTROW176 = 0x11B0         ; Boot row 176
.equ BOOTROW_BOOTROW177 = 0x11B1         ; Boot row 177
.equ BOOTROW_BOOTROW178 = 0x11B2         ; Boot row 178
.equ BOOTROW_BOOTROW179 = 0x11B3         ; Boot row 179
.equ BOOTROW_BOOTROW180 = 0x11B4         ; Boot row 180
.equ BOOTROW_BOOTROW181 = 0x11B5         ; Boot row 181
.equ BOOTROW_BOOTROW182 = 0x11B6         ; Boot row 182
.equ BOOTROW_BOOTROW183 = 0x11B7         ; Boot row 183
.equ BOOTROW_BOOTROW184 = 0x11B8         ; Boot row 184
.equ BOOTROW_BOOTROW185 = 0x11B9         ; Boot row 185
.equ BOOTROW_BOOTROW186 = 0x11BA         ; Boot row 186
.equ BOOTROW_BOOTROW187 = 0x11BB         ; Boot row 187
.equ BOOTROW_BOOTROW188 = 0x11BC         ; Boot row 188
.equ BOOTROW_BOOTROW189 = 0x11BD         ; Boot row 189
.equ BOOTROW_BOOTROW190 = 0x11BE         ; Boot row 190
.equ BOOTROW_BOOTROW191 = 0x11BF         ; Boot row 191
.equ BOOTROW_BOOTROW192 = 0x11C0         ; Boot row 192
.equ BOOTROW_BOOTROW193 = 0x11C1         ; Boot row 193
.equ BOOTROW_BOOTROW194 = 0x11C2         ; Boot row 194
.equ BOOTROW_BOOTROW195 = 0x11C3         ; Boot row 195
.equ BOOTROW_BOOTROW196 = 0x11C4         ; Boot row 196
.equ BOOTROW_BOOTROW197 = 0x11C5         ; Boot row 197
.equ BOOTROW_BOOTROW198 = 0x11C6         ; Boot row 198
.equ BOOTROW_BOOTROW199 = 0x11C7         ; Boot row 199
.equ BOOTROW_BOOTROW200 = 0x11C8         ; Boot row 200
.equ BOOTROW_BOOTROW201 = 0x11C9         ; Boot row 201
.equ BOOTROW_BOOTROW202 = 0x11CA         ; Boot row 202
.equ BOOTROW_BOOTROW203 = 0x11CB         ; Boot row 203
.equ BOOTROW_BOOTROW204 = 0x11CC         ; Boot row 204
.equ BOOTROW_BOOTROW205 = 0x11CD         ; Boot row 205
.equ BOOTROW_BOOTROW206 = 0x11CE         ; Boot row 206
.equ BOOTROW_BOOTROW207 = 0x11CF         ; Boot row 207
.equ BOOTROW_BOOTROW208 = 0x11D0         ; Boot row 208
.equ BOOTROW_BOOTROW209 = 0x11D1         ; Boot row 209
.equ BOOTROW_BOOTROW210 = 0x11D2         ; Boot row 210
.equ BOOTROW_BOOTROW211 = 0x11D3         ; Boot row 211
.equ BOOTROW_BOOTROW212 = 0x11D4         ; Boot row 212
.equ BOOTROW_BOOTROW213 = 0x11D5         ; Boot row 213
.equ BOOTROW_BOOTROW214 = 0x11D6         ; Boot row 214
.equ BOOTROW_BOOTROW215 = 0x11D7         ; Boot row 215
.equ BOOTROW_BOOTROW216 = 0x11D8         ; Boot row 216
.equ BOOTROW_BOOTROW217 = 0x11D9         ; Boot row 217
.equ BOOTROW_BOOTROW218 = 0x11DA         ; Boot row 218
.equ BOOTROW_BOOTROW219 = 0x11DB         ; Boot row 219
.equ BOOTROW_BOOTROW220 = 0x11DC         ; Boot row 220
.equ BOOTROW_BOOTROW221 = 0x11DD         ; Boot row 221
.equ BOOTROW_BOOTROW222 = 0x11DE         ; Boot row 222
.equ BOOTROW_BOOTROW223 = 0x11DF         ; Boot row 223
.equ BOOTROW_BOOTROW224 = 0x11E0         ; Boot row 224
.equ BOOTROW_BOOTROW225 = 0x11E1         ; Boot row 225
.equ BOOTROW_BOOTROW226 = 0x11E2         ; Boot row 226
.equ BOOTROW_BOOTROW227 = 0x11E3         ; Boot row 227
.equ BOOTROW_BOOTROW228 = 0x11E4         ; Boot row 228
.equ BOOTROW_BOOTROW229 = 0x11E5         ; Boot row 229
.equ BOOTROW_BOOTROW230 = 0x11E6         ; Boot row 230
.equ BOOTROW_BOOTROW231 = 0x11E7         ; Boot row 231
.equ BOOTROW_BOOTROW232 = 0x11E8         ; Boot row 232
.equ BOOTROW_BOOTROW233 = 0x11E9         ; Boot row 233
.equ BOOTROW_BOOTROW234 = 0x11EA         ; Boot row 234
.equ BOOTROW_BOOTROW235 = 0x11EB         ; Boot row 235
.equ BOOTROW_BOOTROW236 = 0x11EC         ; Boot row 236
.equ BOOTROW_BOOTROW237 = 0x11ED         ; Boot row 237
.equ BOOTROW_BOOTROW238 = 0x11EE         ; Boot row 238
.equ BOOTROW_BOOTROW239 = 0x11EF         ; Boot row 239
.equ BOOTROW_BOOTROW240 = 0x11F0         ; Boot row 240
.equ BOOTROW_BOOTROW241 = 0x11F1         ; Boot row 241
.equ BOOTROW_BOOTROW242 = 0x11F2         ; Boot row 242
.equ BOOTROW_BOOTROW243 = 0x11F3         ; Boot row 243
.equ BOOTROW_BOOTROW244 = 0x11F4         ; Boot row 244
.equ BOOTROW_BOOTROW245 = 0x11F5         ; Boot row 245
.equ BOOTROW_BOOTROW246 = 0x11F6         ; Boot row 246
.equ BOOTROW_BOOTROW247 = 0x11F7         ; Boot row 247
.equ BOOTROW_BOOTROW248 = 0x11F8         ; Boot row 248
.equ BOOTROW_BOOTROW249 = 0x11F9         ; Boot row 249
.equ BOOTROW_BOOTROW250 = 0x11FA         ; Boot row 250
.equ BOOTROW_BOOTROW251 = 0x11FB         ; Boot row 251
.equ BOOTROW_BOOTROW252 = 0x11FC         ; Boot row 252
.equ BOOTROW_BOOTROW253 = 0x11FD         ; Boot row 253
.equ BOOTROW_BOOTROW254 = 0x11FE         ; Boot row 254
.equ BOOTROW_BOOTROW255 = 0x11FF         ; Boot row 255

;*************************************************************************
;** CCL - Configurable Custom Logic
;*************************************************************************

