pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR64DU28def.inc
; AC_DACREF masks
.equ AC_DACREF_gm = 0xFF                 ; DACREF group mask
.equ AC_DACREF_gp = 0                    ; DACREF group position
.equ AC_DACREF_0_bm = (1<<0)             ; DACREF bit 0 mask
.equ AC_DACREF_0_bp = 0                  ; DACREF bit 0 position
.equ AC_DACREF_1_bm = (1<<1)             ; DACREF bit 1 mask
.equ AC_DACREF_1_bp = 1                  ; DACREF bit 1 position
.equ AC_DACREF_2_bm = (1<<2)             ; DACREF bit 2 mask
.equ AC_DACREF_2_bp = 2                  ; DACREF bit 2 position
.equ AC_DACREF_3_bm = (1<<3)             ; DACREF bit 3 mask
.equ AC_DACREF_3_bp = 3                  ; DACREF bit 3 position
.equ AC_DACREF_4_bm = (1<<4)             ; DACREF bit 4 mask
.equ AC_DACREF_4_bp = 4                  ; DACREF bit 4 position
.equ AC_DACREF_5_bm = (1<<5)             ; DACREF bit 5 mask
.equ AC_DACREF_5_bp = 5                  ; DACREF bit 5 position
.equ AC_DACREF_6_bm = (1<<6)             ; DACREF bit 6 mask
.equ AC_DACREF_6_bp = 6                  ; DACREF bit 6 position
.equ AC_DACREF_7_bm = (1<<7)             ; DACREF bit 7 mask
.equ AC_DACREF_7_bp = 7                  ; DACREF bit 7 position

; AC_INTCTRL masks
.equ AC_CMP_bm = 0x01                    ; Interrupt Enable bit mask
.equ AC_CMP_bp = 0                       ; Interrupt Enable bit position
.equ AC_INTMODE_gm = 0x30                ; Interrupt Mode group mask
.equ AC_INTMODE_gp = 4                   ; Interrupt Mode group position
.equ AC_INTMODE_0_bm = (1<<4)            ; Interrupt Mode bit 0 mask
.equ AC_INTMODE_0_bp = 4                 ; Interrupt Mode bit 0 position
.equ AC_INTMODE_1_bm = (1<<5)            ; Interrupt Mode bit 1 mask
.equ AC_INTMODE_1_bp = 5                 ; Interrupt Mode bit 1 position

; AC_STATUS masks
.equ AC_CMPIF_bm = 0x01                  ; Analog Comparator Interrupt Flag bit mask
.equ AC_CMPIF_bp = 0                     ; Analog Comparator Interrupt Flag bit position
.equ AC_CMPSTATE_bm = 0x10               ; Analog Comparator State bit mask
.equ AC_CMPSTATE_bp = 4                  ; Analog Comparator State bit position

; Hysteresis Mode select
.equ AC_HYSMODE_NONE_gc = (0x00<<1)      ; No hysteresis
.equ AC_HYSMODE_SMALL_gc = (0x01<<1)     ; Small hysteresis
.equ AC_HYSMODE_MEDIUM_gc = (0x02<<1)    ; Medium hysteresis
.equ AC_HYSMODE_LARGE_gc = (0x03<<1)     ; Large hysteresis

; Power profile select
.equ AC_POWER_PROFILE0_gc = (0x00<<3)    ; Power profile 0, lowest consumption and highest response time.
.equ AC_POWER_PROFILE1_gc = (0x01<<3)    ; Power profile 1
.equ AC_POWER_PROFILE2_gc = (0x02<<3)    ; Power profile 2
.equ AC_POWER_PROFILE3_gc = (0x03<<3)    ; Power profile 3

; Interrupt Mode select
.equ AC_NORMAL_INTMODE_BOTHEDGE_gc = (0x00<<4) ; Positive and negative inputs crosses
.equ AC_NORMAL_INTMODE_NEGEDGE_gc = (0x02<<4) ; Positive input goes below negative input
.equ AC_NORMAL_INTMODE_POSEDGE_gc = (0x03<<4) ; Positive input goes above negative input

; AC Output Initial Value select
.equ AC_INITVAL_LOW_gc = (0x00<<6)       ; Output initialized to 0
.equ AC_INITVAL_HIGH_gc = (0x01<<6)      ; Output initialized to 1

; Negative Input MUX Selection
.equ AC_MUXNEG_AINN0_gc = (0x00<<0)      ; Negative Pin 0
.equ AC_MUXNEG_AINN1_gc = (0x01<<0)      ; Negative Pin 1
.equ AC_MUXNEG_AINN2_gc = (0x02<<0)      ; Negative Pin 2
.equ AC_MUXNEG_DACREF_gc = (0x04<<0)     ; DAC Reference

; Positive Input MUX Selection
.equ AC_MUXPOS_AINP0_gc = (0x00<<3)      ; Positive Pin 0
.equ AC_MUXPOS_AINP3_gc = (0x03<<3)      ; Positive Pin 3
.equ AC_MUXPOS_AINP4_gc = (0x04<<3)      ; Positive Pin 4


;*************************************************************************
;** ADC - Analog to Digital Converter
;*************************************************************************

; ADC_CTRLA masks
.equ ADC_ENABLE_bm = 0x01                ; ADC Enable bit mask
.equ ADC_ENABLE_bp = 0                   ; ADC Enable bit position
.equ ADC_LOWLAT_bm = 0x20                ; Conversion mode bit mask
.equ ADC_LOWLAT_bp = 5                   ; Conversion mode bit position
.equ ADC_RUNSTBY_bm = 0x80               ; Run standby mode bit mask
.equ ADC_RUNSTBY_bp = 7                  ; Run standby mode bit position

; ADC_CTRLB masks
.equ ADC_PRESC_gm = 0x0F                 ; Clock Pre-scaler group mask
.equ ADC_PRESC_gp = 0                    ; Clock Pre-scaler group position
.equ ADC_PRESC_0_bm = (1<<0)             ; Clock Pre-scaler bit 0 mask
.equ ADC_PRESC_0_bp = 0                  ; Clock Pre-scaler bit 0 position
.equ ADC_PRESC_1_bm = (1<<1)             ; Clock Pre-scaler bit 1 mask
.equ ADC_PRESC_1_bp = 1                  ; Clock Pre-scaler bit 1 position
.equ ADC_PRESC_2_bm = (1<<2)             ; Clock Pre-scaler bit 2 mask
.equ ADC_PRESC_2_bp = 2                  ; Clock Pre-scaler bit 2 position
.equ ADC_PRESC_3_bm = (1<<3)             ; Clock Pre-scaler bit 3 mask
.equ ADC_PRESC_3_bp = 3                  ; Clock Pre-scaler bit 3 position

; ADC_CTRLC masks
.equ ADC_REFSEL_gm = 0x07                ; Reference Selection group mask
.equ ADC_REFSEL_gp = 0                   ; Reference Selection group position
.equ ADC_REFSEL_0_bm = (1<<0)            ; Reference Selection bit 0 mask
.equ ADC_REFSEL_0_bp = 0                 ; Reference Selection bit 0 position
.equ ADC_REFSEL_1_bm = (1<<1)            ; Reference Selection bit 1 mask
.equ ADC_REFSEL_1_bp = 1                 ; Reference Selection bit 1 position
.equ ADC_REFSEL_2_bm = (1<<2)            ; Reference Selection bit 2 mask
.equ ADC_REFSEL_2_bp = 2                 ; Reference Selection bit 2 position

; ADC_CTRLD masks
.equ ADC_WINCM_gm = 0x07                 ; Window Comparator Mode group mask
.equ ADC_WINCM_gp = 0                    ; Window Comparator Mode group position
.equ ADC_WINCM_0_bm = (1<<0)             ; Window Comparator Mode bit 0 mask
.equ ADC_WINCM_0_bp = 0                  ; Window Comparator Mode bit 0 position
.equ ADC_WINCM_1_bm = (1<<1)             ; Window Comparator Mode bit 1 mask
.equ ADC_WINCM_1_bp = 1                  ; Window Comparator Mode bit 1 position
.equ ADC_WINCM_2_bm = (1<<2)             ; Window Comparator Mode bit 2 mask
.equ ADC_WINCM_2_bp = 2                  ; Window Comparator Mode bit 2 position
.equ ADC_WINSRC_bm = 0x08                ; Window Mode Source bit mask
.equ ADC_WINSRC_bp = 3                   ; Window Mode Source bit position

; ADC_CTRLE masks
.equ ADC_SAMPDUR_gm = 0xFF               ; Sample Duration group mask
.equ ADC_SAMPDUR_gp = 0                  ; Sample Duration group position
.equ ADC_SAMPDUR_0_bm = (1<<0)           ; Sample Duration bit 0 mask
.equ ADC_SAMPDUR_0_bp = 0                ; Sample Duration bit 0 position
.equ ADC_SAMPDUR_1_bm = (1<<1)           ; Sample Duration bit 1 mask
.equ ADC_SAMPDUR_1_bp = 1                ; Sample Duration bit 1 position
.equ ADC_SAMPDUR_2_bm = (1<<2)           ; Sample Duration bit 2 mask
.equ ADC_SAMPDUR_2_bp = 2                ; Sample Duration bit 2 position
.equ ADC_SAMPDUR_3_bm = (1<<3)           ; Sample Duration bit 3 mask
.equ ADC_SAMPDUR_3_bp = 3                ; Sample Duration bit 3 position
.equ ADC_SAMPDUR_4_bm = (1<<4)           ; Sample Duration bit 4 mask
.equ ADC_SAMPDUR_4_bp = 4                ; Sample Duration bit 4 position
.equ ADC_SAMPDUR_5_bm = (1<<5)           ; Sample Duration bit 5 mask
.equ ADC_SAMPDUR_5_bp = 5                ; Sample Duration bit 5 position
.equ ADC_SAMPDUR_6_bm = (1<<6)           ; Sample Duration bit 6 mask
.equ ADC_SAMPDUR_6_bp = 6                ; Sample Duration bit 6 position
.equ ADC_SAMPDUR_7_bm = (1<<7)           ; Sample Duration bit 7 mask
.equ ADC_SAMPDUR_7_bp = 7                ; Sample Duration bit 7 position

