pkwasniok/avr-db-template/lib/atpack/avrasm/inc/AVR64DU28def.inc
; USB_EP_TABLE_FIFO masks
.equ USB_EP_TABLE_DIR_bm = 0x08          ; Endpoint Direction bit mask
.equ USB_EP_TABLE_DIR_bp = 3             ; Endpoint Direction bit position
.equ USB_EP_TABLE_EPNUM_gm = 0xF0        ; Endpoint Number group mask
.equ USB_EP_TABLE_EPNUM_gp = 4           ; Endpoint Number group position
.equ USB_EP_TABLE_EPNUM_0_bm = (1<<4)    ; Endpoint Number bit 0 mask
.equ USB_EP_TABLE_EPNUM_0_bp = 4         ; Endpoint Number bit 0 position
.equ USB_EP_TABLE_EPNUM_1_bm = (1<<5)    ; Endpoint Number bit 1 mask
.equ USB_EP_TABLE_EPNUM_1_bp = 5         ; Endpoint Number bit 1 position
.equ USB_EP_TABLE_EPNUM_2_bm = (1<<6)    ; Endpoint Number bit 2 mask
.equ USB_EP_TABLE_EPNUM_2_bp = 6         ; Endpoint Number bit 2 position
.equ USB_EP_TABLE_EPNUM_3_bm = (1<<7)    ; Endpoint Number bit 3 mask
.equ USB_EP_TABLE_EPNUM_3_bp = 7         ; Endpoint Number bit 3 position

; USB_EP_TABLE_FRAMENUM masks
.equ USB_EP_TABLE_FRAMENUM_gm = 0x7FF    ; Frame Number group mask
.equ USB_EP_TABLE_FRAMENUM_gp = 0        ; Frame Number group position
.equ USB_EP_TABLE_FRAMENUM_0_bm = (1<<0) ; Frame Number bit 0 mask
.equ USB_EP_TABLE_FRAMENUM_0_bp = 0      ; Frame Number bit 0 position
.equ USB_EP_TABLE_FRAMENUM_1_bm = (1<<1) ; Frame Number bit 1 mask
.equ USB_EP_TABLE_FRAMENUM_1_bp = 1      ; Frame Number bit 1 position
.equ USB_EP_TABLE_FRAMENUM_2_bm = (1<<2) ; Frame Number bit 2 mask
.equ USB_EP_TABLE_FRAMENUM_2_bp = 2      ; Frame Number bit 2 position
.equ USB_EP_TABLE_FRAMENUM_3_bm = (1<<3) ; Frame Number bit 3 mask
.equ USB_EP_TABLE_FRAMENUM_3_bp = 3      ; Frame Number bit 3 position
.equ USB_EP_TABLE_FRAMENUM_4_bm = (1<<4) ; Frame Number bit 4 mask
.equ USB_EP_TABLE_FRAMENUM_4_bp = 4      ; Frame Number bit 4 position
.equ USB_EP_TABLE_FRAMENUM_5_bm = (1<<5) ; Frame Number bit 5 mask
.equ USB_EP_TABLE_FRAMENUM_5_bp = 5      ; Frame Number bit 5 position
.equ USB_EP_TABLE_FRAMENUM_6_bm = (1<<6) ; Frame Number bit 6 mask
.equ USB_EP_TABLE_FRAMENUM_6_bp = 6      ; Frame Number bit 6 position
.equ USB_EP_TABLE_FRAMENUM_7_bm = (1<<7) ; Frame Number bit 7 mask
.equ USB_EP_TABLE_FRAMENUM_7_bp = 7      ; Frame Number bit 7 position
.equ USB_EP_TABLE_FRAMENUM_8_bm = (1<<8) ; Frame Number bit 8 mask
.equ USB_EP_TABLE_FRAMENUM_8_bp = 8      ; Frame Number bit 8 position
.equ USB_EP_TABLE_FRAMENUM_9_bm = (1<<9) ; Frame Number bit 9 mask
.equ USB_EP_TABLE_FRAMENUM_9_bp = 9      ; Frame Number bit 9 position
.equ USB_EP_TABLE_FRAMENUM_10_bm = (1<<10) ; Frame Number bit 10 mask
.equ USB_EP_TABLE_FRAMENUM_10_bp = 10    ; Frame Number bit 10 position
.equ USB_EP_TABLE_FRAMEERR_bm = 0x8000   ; Frame Error bit mask
.equ USB_EP_TABLE_FRAMEERR_bp = 15       ; Frame Error bit position

; USB_STATUS_OUTCLR masks
.equ USB_STATUS_RMWSTATUS_gm = 0xFF      ; Read-Modify-Write Endpoint STATUS group mask
.equ USB_STATUS_RMWSTATUS_gp = 0         ; Read-Modify-Write Endpoint STATUS group position
.equ USB_STATUS_RMWSTATUS_0_bm = (1<<0)  ; Read-Modify-Write Endpoint STATUS bit 0 mask
.equ USB_STATUS_RMWSTATUS_0_bp = 0       ; Read-Modify-Write Endpoint STATUS bit 0 position
.equ USB_STATUS_RMWSTATUS_1_bm = (1<<1)  ; Read-Modify-Write Endpoint STATUS bit 1 mask
.equ USB_STATUS_RMWSTATUS_1_bp = 1       ; Read-Modify-Write Endpoint STATUS bit 1 position
.equ USB_STATUS_RMWSTATUS_2_bm = (1<<2)  ; Read-Modify-Write Endpoint STATUS bit 2 mask
.equ USB_STATUS_RMWSTATUS_2_bp = 2       ; Read-Modify-Write Endpoint STATUS bit 2 position
.equ USB_STATUS_RMWSTATUS_3_bm = (1<<3)  ; Read-Modify-Write Endpoint STATUS bit 3 mask
.equ USB_STATUS_RMWSTATUS_3_bp = 3       ; Read-Modify-Write Endpoint STATUS bit 3 position
.equ USB_STATUS_RMWSTATUS_4_bm = (1<<4)  ; Read-Modify-Write Endpoint STATUS bit 4 mask
.equ USB_STATUS_RMWSTATUS_4_bp = 4       ; Read-Modify-Write Endpoint STATUS bit 4 position
.equ USB_STATUS_RMWSTATUS_5_bm = (1<<5)  ; Read-Modify-Write Endpoint STATUS bit 5 mask
.equ USB_STATUS_RMWSTATUS_5_bp = 5       ; Read-Modify-Write Endpoint STATUS bit 5 position
.equ USB_STATUS_RMWSTATUS_6_bm = (1<<6)  ; Read-Modify-Write Endpoint STATUS bit 6 mask
.equ USB_STATUS_RMWSTATUS_6_bp = 6       ; Read-Modify-Write Endpoint STATUS bit 6 position
.equ USB_STATUS_RMWSTATUS_7_bm = (1<<7)  ; Read-Modify-Write Endpoint STATUS bit 7 mask
.equ USB_STATUS_RMWSTATUS_7_bp = 7       ; Read-Modify-Write Endpoint STATUS bit 7 position

; USB_STATUS_OUTSET masks
; Masks for USB_STATUS_RMWSTATUS already defined

; USB_STATUS_INCLR masks
; Masks for USB_STATUS_RMWSTATUS already defined

; USB_STATUS_INSET masks
; Masks for USB_STATUS_RMWSTATUS already defined

; USB_CTRLA masks
.equ USB_MAXEP_gm = 0x0F                 ; Maximum Endpoint Address group mask
.equ USB_MAXEP_gp = 0                    ; Maximum Endpoint Address group position
.equ USB_MAXEP_0_bm = (1<<0)             ; Maximum Endpoint Address bit 0 mask
.equ USB_MAXEP_0_bp = 0                  ; Maximum Endpoint Address bit 0 position
.equ USB_MAXEP_1_bm = (1<<1)             ; Maximum Endpoint Address bit 1 mask
.equ USB_MAXEP_1_bp = 1                  ; Maximum Endpoint Address bit 1 position
.equ USB_MAXEP_2_bm = (1<<2)             ; Maximum Endpoint Address bit 2 mask
.equ USB_MAXEP_2_bp = 2                  ; Maximum Endpoint Address bit 2 position
.equ USB_MAXEP_3_bm = (1<<3)             ; Maximum Endpoint Address bit 3 mask
.equ USB_MAXEP_3_bp = 3                  ; Maximum Endpoint Address bit 3 position
.equ USB_STFRNUM_bm = 0x10               ; Store Frame Number Enable bit mask
.equ USB_STFRNUM_bp = 4                  ; Store Frame Number Enable bit position
.equ USB_FIFOEN_bm = 0x20                ; Transaction Complete FIFO Enable bit mask
.equ USB_FIFOEN_bp = 5                   ; Transaction Complete FIFO Enable bit position
.equ USB_ENABLE_bm = 0x80                ; USB Enable bit mask
.equ USB_ENABLE_bp = 7                   ; USB Enable bit position

; USB_CTRLB masks
.equ USB_ATTACH_bm = 0x01                ; Attach bit mask
.equ USB_ATTACH_bp = 0                   ; Attach bit position
.equ USB_GNAK_bm = 0x02                  ; Respond with NAK on all Endpoints bit mask
.equ USB_GNAK_bp = 1                     ; Respond with NAK on all Endpoints bit position
.equ USB_GNAUTO_bm = 0x04                ; Set GNAK Automatically after SETUP bit mask
.equ USB_GNAUTO_bp = 2                   ; Set GNAK Automatically after SETUP bit position
.equ USB_URESUME_bm = 0x08               ; Send Upstream Resume bit mask
.equ USB_URESUME_bp = 3                  ; Send Upstream Resume bit position

; USB_BUSSTATE masks
.equ USB_BUSRST_bm = 0x01                ; Bus Reset bit mask
.equ USB_BUSRST_bp = 0                   ; Bus Reset bit position
.equ USB_SUSPENDED_bm = 0x02             ; Bus Suspended bit mask
.equ USB_SUSPENDED_bp = 1                ; Bus Suspended bit position
.equ USB_DRESUME_bm = 0x04               ; Downstram Resume bit mask
.equ USB_DRESUME_bp = 2                  ; Downstram Resume bit position
; Masks for USB_URESUME already defined
.equ USB_WTRSM_bm = 0x10                 ; Wait Time Resume bit mask
.equ USB_WTRSM_bp = 4                    ; Wait Time Resume bit position

